dominichuggonsonotteo-prog/GridInv3P/MDK_ARM/.pack/Keil/STM32F3xx_DFP.2.1.0/CMSIS/Driver/USBD_STM32F3xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2017 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        10. November 2017
 * $Revision:    V1.0
 *
 * Driver:       Driver_USBD0
 *
 * Configured:   via STM32CubeMx configuration tool
 * Project:      USB Full/Low-Speed Device Driver for
 *               STMicroelectronics STM32F3xx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                  Value
 *   ---------------------                  -----
 *   Connect to hardware via Driver_USBD# = 0
 * --------------------------------------------------------------------------
 * Defines used for driver configuration (at compile time):
 *   USBD_MAX_ENDPOINT_NUM: defines maximum number of IN/OUT Endpoint pairs
 *                          that driver will support with Control Endpoint 0
 *                          not included, this value impacts driver memory
 *                          requirements
 *     - default value:     2
 *     - maximum value:     7
 *
 *   USBD_EP0_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 0 reception
 *     - default value:     0
 *   USBD_EP0_RX_RAM_SIZE:  RAM size for reception for          endpoint 0
 *     - default value:     64
 *   USBD_EP0_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 0 reception
 *     - default value:     0
 *   USBD_EP0_TX_RAM_SIZE:  RAM size for transmission for       endpoint 0
 *     - default value:     64
 *
 *   USBD_EP1_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 1 reception
 *     - default value:     0
 *   USBD_EP1_RX_RAM_SIZE:  RAM size for reception for          endpoint 1
 *     - default value:     64
 *   USBD_EP1_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 1 reception
 *     - default value:     0
 *   USBD_EP1_TX_RAM_SIZE:  RAM size for transmission for       endpoint 1
 *     - default value:     64
 *
 *   USBD_EP2_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 2 reception
 *     - default value:     0
 *   USBD_EP2_RX_RAM_SIZE:  RAM size for reception for          endpoint 2
 *     - default value:     64
 *   USBD_EP2_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 2 reception
 *     - default value:     0
 *   USBD_EP2_TX_RAM_SIZE:  RAM size for transmission for       endpoint 2
 *     - default value:     64
 *
 *   USBD_EP3_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 3 reception
 *     - default value:     0
 *   USBD_EP3_RX_RAM_SIZE:  RAM size for reception for          endpoint 3
 *     - default value:     0
 *   USBD_EP3_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 3 reception
 *     - default value:     0
 *   USBD_EP3_TX_RAM_SIZE:  RAM size for transmission for       endpoint 3
 *     - default value:     0
 *
 *   USBD_EP4_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 4 reception
 *     - default value:     0
 *   USBD_EP4_RX_RAM_SIZE:  RAM size for reception for          endpoint 4
 *     - default value:     0
 *   USBD_EP4_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 4 reception
 *     - default value:     0
 *   USBD_EP4_TX_RAM_SIZE:  RAM size for transmission for       endpoint 4
 *     - default value:     0
 *
 *   USBD_EP5_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 5 reception
 *     - default value:     0
 *   USBD_EP5_RX_RAM_SIZE:  RAM size for reception for          endpoint 5
 *     - default value:     0
 *   USBD_EP5_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 5 reception
 *     - default value:     0
 *   USBD_EP5_TX_RAM_SIZE:  RAM size for transmission for       endpoint 5
 *     - default value:     0
 *
 *   USBD_EP6_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 6 reception
 *     - default value:     0
 *   USBD_EP6_RX_RAM_SIZE:  RAM size for reception for          endpoint 6
 *     - default value:     0
 *   USBD_EP6_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 6 reception
 *     - default value:     0
 *   USBD_EP6_TX_RAM_SIZE:  RAM size for transmission for       endpoint 6
 *     - default value:     0
 *
 *   USBD_EP7_RX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 7 reception
 *     - default value:     0
 *   USBD_EP7_RX_RAM_SIZE:  RAM size for reception for          endpoint 7
 *     - default value:     0
 *   USBD_EP7_TX_BUF_KIND:  Single (=0) or double (=1) buffered endpoint 7 reception
 *     - default value:     0
 *   USBD_EP7_TX_RAM_SIZE:  RAM size for transmission for       endpoint 7
 *     - default value:     0
 *
 * Notes:
 *   - HAL does not support double buffering
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.0
 *    Initial release
 */

/*! \page stm32f3_usbd CMSIS-Driver USBD Setup

The CMSIS-Driver USBD requires:
  - Setup of USB clock to 48MHz
  - Configuration of USB as Device (FS)

Valid settings for various evaluation boards are listed in the table below:

Peripheral Resource | STM32373C-EVAL |
:-------------------|:---------------|
USB Peripheral      | USB            |
D- Pin              | PA11           |
D+ Pin              | PA12           |
For different boards, refer to the hardware schematics to reflect correct setup values.

